---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideError
source: html/eda29af1-7a31-9acd-288c-fbaddc8755bc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideError Property

The segment is being drawn from the wrong side to connect to the location you indicated.

## Syntax (C#)
```csharp
public static FailureDefinitionId SegmentDrawnFromWrongSideError { get; }
```